# <font color='blue'> Exploratory Data Analysis with Python: Part 2 of 2</font>

### Lise Doucette, Data and Statistics Librarian
### Nich Worby, Government Information and Statistics Librarian
### mdl@library.utoronto.ca

# <font color='blue'> Outline </font>

## <font color='blue'> 1 Creating crosstabs and grouping data </font>

## <font color='blue'> Review: Selecting Data (from the Python workshop part 1)

## <font color='blue'> 2 Editing data and creating new variables </font>
- a. Renaming variable categories
- b. Creating new variable with a calculation
- c. Splitting name into first and last
- d. Grouping values of a variable

Review: Getting help (from the Python workshop part 1)

### Import libraries

In [1]:
import pandas as pd

### Import data set

In [2]:
titanic = pd.read_csv('titanic.csv', sep=';')

### Correct data types

Recall the syntax for correcting data types:

~~~
titanic['ColumnName'] = titanic['ColumnName'].astype('NewDataType')
~~~

In [19]:
titanic['body'] = titanic['body'].astype('object')
titanic['pclass']= titanic['pclass'].astype('category')
titanic['survived'] = titanic['survived'].astype('category')
titanic['sex'] = titanic['sex'].astype('category')
titanic['embarked'] = titanic['embarked'].astype('category')

In [20]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null category
survived     1309 non-null category
name         1309 non-null object
sex          1309 non-null category
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null category
boat         486 non-null object
body         121 non-null object
home.dest    745 non-null object
dtypes: category(4), float64(2), int64(2), object(6)
memory usage: 107.5+ KB

## <font color='blue'>1 Creating crosstabs and grouping data</font>

### a) Create crosstabs

Things to think about:
- data types of variables you're interested in

Crosstabs are a way of looking at potential relationships between two or more variables. Variables are plotted against each other in a table with variables on the x and y axes. The cells contain the number of times the a combination of categories occurred. For example:

![crosstab](https://github.com/nichworby/python/blob/master/crosstab.png)

The syntax is slightly different than some of the selecting and filtering we did in the previous class. To create a crosstab, use the following syntax:

    pd.crosstab(dataframe.variable, dataframe.variable2)

If ever you have questions about how to use syntax, it's useful to check out the pandas library's [help file](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.crosstab.html). For example, the normalize function creates percentages.

In [21]:
pd.crosstab(titanic.pclass, titanic.survived)

survived    0    1
pclass
1         123  200
2         158  119
3         528  181

Use the normalize argument to display crosstab values as percentages

In [22]:
pd.crosstab(titanic.pclass, titanic.survived, normalize='index')

survived         0         1
pclass
1         0.380805  0.619195
2         0.570397  0.429603
3         0.744711  0.255289

The normalize argument can also be set to 'columns' to display crosstab values by columns instead of rows.

In [23]:
pd.crosstab(titanic.pclass, titanic.survived, normalize='columns')

survived         0      1
pclass
1         0.152040  0.400
2         0.195303  0.238
3         0.652658  0.362

Crosstabs can be further modified with methods like: `.round()`

In [24]:
pd.crosstab(titanic.pclass, titanic.survived, normalize='index').round(4)

survived       0       1
pclass
1         0.3808  0.6192
2         0.5704  0.4296
3         0.7447  0.2553

Cross tabs aren't just limited to comparing two variables at a time. Let's say we want to compare passenger class, sex and survival rates. We can use square brackets [ ] to incorporate more variables into the crosstab, similar to earlier examples.

In [25]:
pd.crosstab([titanic.pclass, titanic.sex], titanic.survived, normalize='index')

survived              0         1
pclass sex
1      female  0.034722  0.965278
       male    0.659218  0.340782
2      female  0.113208  0.886792
       male    0.853801  0.146199
3      female  0.509259  0.490741
       male    0.847870  0.152130

### b) Grouping Data 

- when does it make sense to use sum, mean, value_counts?

In [26]:
titanic.groupby('pclass').mean()

              age     sibsp     parch       fare
pclass
1       39.159918  0.436533  0.365325  87.508992
2       29.506705  0.393502  0.368231  21.179196
3       24.816367  0.568406  0.400564  13.302889

In [27]:
titanic.groupby('pclass').sum()

               age  sibsp  parch        fare
pclass
1       11121.4167    141    118  28265.4043
2        7701.2500    109    102   5866.6374
3       12433.0000    403    284   9418.4452

In [29]:
titanic.groupby('pclass')['survived'].sum()

TypeError: Categorical cannot perform the operation sum

In [30]:
titanic.groupby('pclass')['survived'].value_counts()

pclass  survived
1       1           200
        0           123
2       0           158
        1           119
3       0           528
        1           181
Name: survived, dtype: int64

### Exercise

1. Create a crosstab to show the numbers of men and women who survived.
2. Create a table to show the same data using groupby.

In [13]:
pd.crosstab(titanic.sex, titanic.survived)

survived    0    1
sex
female    127  339
male      682  161

In [18]:
titanic.groupby('sex')['survived'].value_counts()

sex     survived
female  1           339
        0           127
male    0           682
        1           161
Name: survived, dtype: int64

## <font color='blue'>Review: Selecting Data (from the Python workshop part 1)</font>

__Selecting one column:__

    titanic['col_name']
    
__Selecting multiple columns:__

    titanic[['col1_name','col2_name']]
        
__Filtering by a condition:__

    
    titanic[titanic['fare'] > 50]
    titanic[titanic['name'].str.contains("Robert")]

__Combining filters:__

    titanic[(titanic['fare'] > 50) & (titanic['name'].str.contains(r'\bRobert\b'))]
    
    titanic[(titanic['pclass']==1) | (titanic['pclass']==2)]

## Exercise

1. Create a filter that lists passengers who did not survive
2. Combine the filters we created earlier to create a list of passengers with the name Robert who survived
3. Create a filter that lists passengers in class 1 who were more than 30 years old

In [ ]:
titanic[titanic['survived'] == 0]

In [ ]:
titanic[(titanic['name'].str.contains("Robert")) & (titanic['survived'] == 1)]

In [ ]:
titanic[(titanic['pclass']==1) & (titanic['age']>30)]

### SORTING DATA

Numeric values can be sorted to be displayed either ascending (lowest to highest) or descending values (highest to lowest). Sorting data frames by the value of cells in a particular column uses the following syntax:

        dataframename.sort_values(by=['column'],)
        
Note: The default setting is to sort from lowest to highest. To switch to ordering highest to lowest, add the ascending=False argument.

In [ ]:
titanic.sort_values(by=['age'], )

In [ ]:
titanic.sort_values(by=['age'], ascending = False)

## <font color='blue'>2 Editing data and creating new variables</font>

### a. Renaming variable categories

Often variables in datasets use codes that aren't very descriptive. It's helpful to first view all codes in a variable before editing.

In [7]:
titanic['embarked'].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

Next, read the codebook to understand what the codes mean. There are 3 codes for embarkation points: S = Southampton, C = Cherbourg and Q = Queenstown. Start the next line with the name of the variable you would like to edit, e.g. titanic['embarked']. 

Use the = sign next to make sure you write the change to the entire variable and save it. This is similar to value assignment in algebra, e.g. x = y + z. 

We can use the .replace( ) method to change our codes to names. We can use .value_counts( ) to check our work.

In [8]:
titanic['embarked'] = titanic['embarked'].replace(['S', "C", "Q"], ["Southampton", "Cherbourg", "Queenstown"])

In [9]:
titanic['embarked'].value_counts()

Southampton    914
Cherbourg      270
Queenstown     123
Name: embarked, dtype: int64

### b. Creating a new variable

The syntax for creating new variables in a dataframe starts by calling the dataframe by name and placing the variable name in square brackets in quotes and assigning value with an equal sign.

~~~
dataframe['new variable'] = 
~~~

Let's say we want to calculate the fare variable in Canadian dollars. In 1912, the value of the Canadian dollar was pegged at 4.8666CAD to one British Pound Sterling.

In [10]:
titanic['fare_CAD'] = titanic['fare']*4.8666

Check if the new variable has been added by using the .head( ) method.

In [13]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,fare_CAD
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,Southampton,2,NaN,"St Louis, MO",1028.495077
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,Southampton,11,NaN,"Montreal, PQ / Chesterville, ON",737.533230
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,NaN,"Montreal, PQ / Chesterville, ON",737.533230
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,135.0,"Montreal, PQ / Chesterville, ON",737.533230
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,NaN,"Montreal, PQ / Chesterville, ON",737.533230

### c. Splitting text variables

We might want to create two separate variables for the passenger's last name and their first name.  We need to investigate how the original name variable is structured to determine how to do this.

In [14]:
titanic['name'].str.split(',')

0                        [Allen,  Miss. Elisabeth Walton]
1                       [Allison,  Master. Hudson Trevor]
2                         [Allison,  Miss. Helen Loraine]
3                 [Allison,  Mr. Hudson Joshua Creighton]
4       [Allison,  Mrs. Hudson J C (Bessie Waldo Danie...
5                                  [Anderson,  Mr. Harry]
6                    [Andrews,  Miss. Kornelia Theodosia]
7                               [Andrews,  Mr. Thomas Jr]
8        [Appleton,  Mrs. Edward Dale (Charlotte Lamson)]
9                              [Artagaveytia,  Mr. Ramon]
10                              [Astor,  Col. John Jacob]
11      [Astor,  Mrs. John Jacob (Madeleine Talmadge F...
12                       [Aubart,  Mme. Leontine Pauline]
13                        [Barber,  Miss. Ellen "Nellie"]
14                [Barkworth,  Mr. Algernon Henry Wilson]
15                                 [Baumann,  Mr. John D]
16                            [Baxter,  Mr. Quigg Edmond]
17      [Baxter,  Mrs. James (Helene DeLaudeniere Chap...
18                               [Bazzani,  Miss. Albina]
19                                [Beattie,  Mr. Thomson]
20                       [Beckwith,  Mr. Richard Leonard]
21      [Beckwith,  Mrs. Richard Leonard (Sallie Monyp...
22                               [Behr,  Mr. Karl Howell]
23                               [Bidois,  Miss. Rosalie]
24                                   [Bird,  Miss. Ellen]
25                                 [Birnbaum,  Mr. Jakob]
26                             [Bishop,  Mr. Dickinson H]
27             [Bishop,  Mrs. Dickinson H (Helen Walton)]
28                              [Bissette,  Miss. Amelia]
29           [Bjornstrom-Steffansson,  Mr. Mauritz Hakan]
                              ...
1279              [Vestrom,  Miss. Hulda Amanda Adolfina]
1280                                   [Vovk,  Mr. Janko]
1281                              [Waelens,  Mr. Achille]
1282                               [Ware,  Mr. Frederick]
1283                       [Warren,  Mr. Charles William]
1284                                 [Webber,  Mr. James]
1285                               [Wenzel,  Mr. Linhart]
1286    [Whabee,  Mrs. George Joseph (Shawneene Abi-Sa...
1287                  [Widegren,  Mr. Carl/Charles Peter]
1288                         [Wiklund,  Mr. Jakob Alfred]
1289                           [Wiklund,  Mr. Karl Johan]
1290                  [Wilkes,  Mrs. James (Ellen Needs)]
1291                  [Willer,  Mr. Aaron ("Abi Weller")]
1292                                [Willey,  Mr. Edward]
1293                 [Williams,  Mr. Howard Hugh "Harry"]
1294                              [Williams,  Mr. Leslie]
1295                               [Windelov,  Mr. Einar]
1296                                  [Wirz,  Mr. Albert]
1297                            [Wiseman,  Mr. Phillippe]
1298                         [Wittevrongel,  Mr. Camille]
1299                               [Yasbeck,  Mr. Antoni]
1300           [Yasbeck,  Mrs. Antoni (Selini Alexander)]
1301                              [Youseff,  Mr. Gerious]
1302                                 [Yousif,  Mr. Wazli]
1303                             [Yousseff,  Mr. Gerious]
1304                              [Zabour,  Miss. Hileni]
1305                             [Zabour,  Miss. Thamine]
1306                         [Zakarian,  Mr. Mapriededer]
1307                               [Zakarian,  Mr. Ortin]
1308                                [Zimmerman,  Mr. Leo]
Name: name, Length: 1309, dtype: object

In [15]:
titanic['lastname'] = titanic['name'].str.split(',').str[0]
titanic['firstname'] = titanic['name'].str.split(',').str[1]

In [16]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,fare_CAD,lastname,firstname
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,Southampton,2,NaN,"St Louis, MO",1028.495077,Allen,Miss. Elisabeth Walton
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,Southampton,11,NaN,"Montreal, PQ / Chesterville, ON",737.533230,Allison,Master. Hudson Trevor
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,NaN,"Montreal, PQ / Chesterville, ON",737.533230,Allison,Miss. Helen Loraine
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,135.0,"Montreal, PQ / Chesterville, ON",737.533230,Allison,Mr. Hudson Joshua Creighton
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,NaN,"Montreal, PQ / Chesterville, ON",737.533230,Allison,Mrs. Hudson J C (Bessie Waldo Daniels)

### d. Creating age bins

We may want to group together people of certain ages, in order to perform certain kinds of analyses or create certain types of graphs.  We first need to know what the age range is:

In [17]:
titanic.age.min()

0.16669999999999999

In [18]:
titanic.age.max()

80.0

In [24]:
help(pd.cut)

Help on function cut in module pandas.core.reshape.tile:

cut(x, bins, right=True, labels=None, retbins=False, precision=3, include_lowest=False)
    Return indices of half-open bins to which each value of `x` belongs.

    Parameters
    ----------
    x : array-like
        Input array to be binned. It has to be 1-dimensional.
    bins : int, sequence of scalars, or IntervalIndex
        If `bins` is an int, it defines the number of equal-width bins in the
        range of `x`. However, in this case, the range of `x` is extended
        by .1% on each side to include the min or max values of `x`. If
        `bins` is a sequence it defines the bin edges allowing for
        non-uniform bin width. No extension of the range of `x` is done in
        this case.
    right : bool, optional
        Indicates whether the bins include the rightmost edge or not. If
        right == True (the default), then the bins [1,2,3,4] indicate
        (1,2], (2,3], (3,4].
    labels : array or boolean, default None
        Used as labels for the resulting bins. Must be of the same length as
        the resulting bins. If False, return only integer indicators of the
        bins.
    retbins : bool, optional
        Whether to return the bins or not. Can be useful if bins is given
        as a scalar.
    precision : int, optional
        The precision at which to store and display the bins labels
    include_lowest : bool, optional
        Whether the first interval should be left-inclusive or not.

    Returns
    -------
    out : Categorical or Series or array of integers if labels is False
        The return type (Categorical or Series) depends on the input: a Series
        of type category if input is a Series else Categorical. Bins are
        represented as categories when categorical data is returned.
    bins : ndarray of floats
        Returned only if `retbins` is True.

    Notes
    -----
    The `cut` function can be useful for going from a continuous variable to
    a categorical variable. For example, `cut` could convert ages to groups
    of age ranges.

    Any NA values will be NA in the result.  Out of bounds values will be NA in
    the resulting Categorical object


    Examples
    --------
    >>> pd.cut(np.array([.2, 1.4, 2.5, 6.2, 9.7, 2.1]), 3, retbins=True)
    ([(0.191, 3.367], (0.191, 3.367], (0.191, 3.367], (3.367, 6.533],
      (6.533, 9.7], (0.191, 3.367]]
    Categories (3, object): [(0.191, 3.367] < (3.367, 6.533] < (6.533, 9.7]],
    array([ 0.1905    ,  3.36666667,  6.53333333,  9.7       ]))

    >>> pd.cut(np.array([.2, 1.4, 2.5, 6.2, 9.7, 2.1]), 3,
               labels=["good","medium","bad"])
    [good, good, good, medium, bad, good]
    Categories (3, object): [good < medium < bad]

    >>> pd.cut(np.ones(5), 4, labels=False)
    array([1, 1, 1, 1, 1], dtype=int64)

Formatting for age bins/groups:

We can create bins by setting the endpoints of the bins.  If we want the bins to cover 10-year groupings of 0-9, 10-19, 20-29, etc., we use the format [0,9,19,29, ...].

With this format, Python takes the first two numbers (0 and 9) and creates the first bin, which  includes all people who are more than 0 years old (i.e., starting at 0.0000001 years old) and less than or equal to 9 years old.

The second bin is created using 9 and 19 and includes all people who are more than 9 years old and less than or equal to 19 years old.

In [27]:
titanic['age_categories'] = pd.cut(titanic['age'], bins=[0, 9, 19, 29, 39, 49, 59, 69, 80])

In [29]:
titanic['age_categories'].value_counts()

(19, 29]    344
(29, 39]    232
(9, 19]     143
(39, 49]    135
(0, 9]       82
(49, 59]     70
(59, 69]     32
(69, 80]      8
Name: age_categories, dtype: int64

In [30]:
pd.crosstab(titanic.age_categories, titanic.survived)

survived          0    1
age_categories
(0, 9]           32   50
(9, 19]          87   56
(19, 29]        217  127
(29, 39]        134   98
(39, 49]         83   52
(49, 59]         38   32
(59, 69]         22   10
(69, 80]          6    2

In [31]:
pd.crosstab([titanic.age_categories, titanic.sex], titanic.survived, normalize='index')

survived                      0         1
age_categories sex
(0, 9]         female  0.358974  0.641026
               male    0.418605  0.581395
(9, 19]        female  0.265625  0.734375
               male    0.886076  0.113924
(19, 29]       female  0.286957  0.713043
               male    0.803493  0.196507
(29, 39]       female  0.209302  0.790698
               male    0.794521  0.205479
(39, 49]       female  0.217391  0.782609
               male    0.820225  0.179775
(49, 59]       female  0.074074  0.925926
               male    0.837209  0.162791
(59, 69]       female  0.200000  0.800000
               male    0.909091  0.090909
(69, 80]       female  0.000000  1.000000
               male    0.857143  0.142857

## Exercise

1. Rename the values of the 'survived' variable to be more meaningful.

2. This question has three parts: 
  
  a. Create a new variable that divides the age variable into two bins: one for children (0-17 years old) and one for adults (18+ years old)   
  
  b. Check the values of your new variable.

  c. Create a crosstab to show the number of child and adult survivors.

In [8]:
titanic['survived'] = titanic['survived'].replace([0, 1], ["Died", "Survived"])
titanic.head() 
#or titanic['survived'].value_counts()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,child_adult
0,1,Survived,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO","(17, 80]"
1,1,Survived,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON","(0, 17]"
2,1,Died,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON","(0, 17]"
3,1,Died,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON","(17, 80]"
4,1,Died,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON","(17, 80]"

In [5]:
titanic['child_adult'] = pd.cut(titanic['age'], bins=[0, 17, 80])

In [6]:
titanic['child_adult'].value_counts()

(17, 80]    892
(0, 17]     154
Name: child_adult, dtype: int64

In [9]:
pd.crosstab(titanic.child_adult, titanic.survived)

survived     Died  Survived
child_adult
(0, 17]        73        81
(17, 80]      546       346

## <font color='blue'>Review: Getting help (from the Python workshop part 1)</font>

- inline/in-program documentation - write the method, e.g., print, in parentheses after the word help
    
        help(print)
    
- official documentation - e.g., [Pandas](https://pandas.pydata.org/)
- 'unofficial' documentation aka Googling and finding examples: python sort data   
- cheat-sheets, e.g., [Wrangling Data with Pandas](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- online guides/tutorials, e.g., [Variables, Strings, and Numbers
](http://introtopython.org/var_string_num.html)
- online courses (no fee), e.g, Python courses through [Linked In Learning](https://lnkd.in/gf85Mmv)
- online courses (fee), e.g., [Python for Data Science and AI](https://www.coursera.org/learn/python-for-applied-data-science-ai)